[
  {
    "id": 1,
    "title": "Dua For Love Of Allah.",
    "dua": "اَللّٰهُمَّ إِنِّىْ أَسْأَلُكَ حُبَّكَ وَحُبَّ مَنْ يُحِبُّكَ وَالْعَمَلَ الَّذِىْ يُبَلِّغُنِىْ حُبَّكَ اَللّٰهُمَّ اجْعَلْ حُبَّكَ أَحَبَّ إِلَىَّ مِنْ نَفْسِىْ وَمَالِىْ وَأَهْلِىْ وَمِنَ الْمَاءِ الْبَارِدِ",
    "significance": "হে আল্লাহ! আমি তোমার কাছে তোমার ভালোবাসা প্রত্যাশা করি, আর যে তোমাকে ভালোবাসে, তার ভালোবাসা চাই এবং আমি ঐ কাজের শক্তি চাই, যে শক্তি আমাকে তোমার ভালোবাসার দিকে নিয়ে যাবে। হে আল্লাহ! তোমার ভালোবাসাকে আমার কাছে আমার জীবন, আমার ধন-সম্পদ, আমার পরিবার-পরিজন ও ঠাণ্ডা পানির চেয়েও বেশি পছন্দনীয় করে তোলো।"
  },
  {
    "id": 2,
    "title": "Dua For Pure Nafs",
    "dua": "اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَعِلْمٍ لَا يَنْفَعُ، وَدَعْوَةٍ لَا يُسْتَجَابُ لَهَا",
    "significance": "হে আল্লাহ! আমার আত্মায় তাকওয়া বা ভয় দান করুন। আর একে (আত্মাকে) মন্দ কাজ থেকে পবিত্র করুন; আপনিই উত্তম পবিত্রকারী আর আপনিই (আত্মার) বন্ধু এবং মালিক। হে আল্লাহ! আমি আপনার কাছে ওই অন্তর থেকে আশ্রয় চাই যে অন্তর ভীত হয় না, আর ওই আত্মা থেকে যা তৃপ্ত হয় না, ওই ইলম বা জ্ঞান থেকে যা উপকারে আসে না। আর ওই দোয়া থেকে যা কবুল করা হয় না।"
  },
  {
    "id": 3,
    "title": "Dua For Forgiveness",
    "dua": "اَللّٰهُمَّ مَغْفِرَتُكَ أَوْسَعُ مِنْ ذُنُوْبِيْ وَرَحْمَتَكَأَ أَرْجَى عِنْدِيْ مِنْ عَمَلِيْ",
    "significance": " হে আল্লাহ আপনার ক্ষমা আমার গুনাহ থেকে অনেক বেশী প্রশস্ত এবং আপনার রহমত এর প্রতি আমি অনেক বেশী আশাবাদী আমার আমাল থেকে "
  },
  {
    "id": 4,
    "title": "Dua For ",
    "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَفِتْنَةِ الْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
    "significance": " কবরের আযাব থেকে, মসীহে দাজ্জালের ফিতনা থেকে এবং জীবন ও মৃত্যুর ফিতনা থেকে ইয় আল্লাহ! আপনার নিকট আশ্রয় প্রার্থনা করছি। ইয়া আল্লাহ্! গুনাহ্ ও ঋণগ্রস্থতা থেকে আপনার নিকট আশ্রয় চাই। "
  },
  {
    "id": 5,
    "title": "Dua For ",
    "dua": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
    "significance": " আমি আল্লাহতায়ালার প্রশংসাসমেত পবিত্রতা ঘোষণা করছি। তার সৃষ্টিকুলের সংখ্যার পরিমাণ, তিনি সন্তুষ্ট হওয়া পরিমাণ, তার আরশের ওজন সমপরিমাণ, তার কথা লিপিবদ্ধ করার কালি পরিমাণ। "
  },
  {
    "id": 6,
    "title": "Dua For Halal Rijik ",
    "dua": "اللَّهُمَّ اكْفِني بِحَلاَلِكَ عَنْ حَرَامِكَ ، وَأغْنِنِي بِفَضْلِكَ عَمَّنْ سِواكَ",
    "significance": " হে আল্লাহ! হারামের পরিবর্তে তোমার হালাল রুজি আমার জন্য যথেষ্ট করো। আপনি আমাকে স্বীয় দয়া ও আনুগ্রহ দ্বারা অন্য সবার থেকে ধনী বানিয়ে দিন। "
  },
  {
    "id": 7,
    "title": "Dua For ",
    "dua": "اَللّٰهُمَّ إنِّي أَسألُكَ الهُدَى وَالتُّقَى وَالعَفَافَ وَالغِنَى",
    "significance": " হে আল্লাহ আমি আপনার কাছে হেদায়েত কামনা করি এবং আপনার ভয় তথা পরহেজগারি কামনা করি এবং আপনার কাছে সুস্থতা তথা নৈতিক পবিত্রতা কামনা করি এবং সম্পদ তথা সামর্থ্য কামনা করি। "
  },
  {
    "id": 8,
    "title": "Dua For ",
    "dua": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنْ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ",
    "significance": " হে আল্লাহ্! তুমি আমাকে আমার পাপগুলো থেকে এত দূরে রাখ যেমন পূর্ব ও পশ্চিম পরস্পরকে পরস্পর থেকে দূরে রেখেছ। হে আল্লাহ্! তুমি আমাকে আমার পাপ হতে এমন ভাবে পরিষ্কার করে দাও, যেমন সাদা কাপড়কে ময়লা হতে পরিষ্কার করা হয়। হে আল্লাহ্! তুমি আমাকে আমার পাপ হতে (পবিত্র করার জন্য) পানি, বরফ ও শিশির দ্বারা ধুয়ে পরিষ্কার করে দাও "
  },
  {
    "id": 9,
    "title": "Dua For ",
    "dua": "اَللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَسْرَفْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ",
    "significance": " হে আল্লাহ! তুমি আমার আগের ও পরের সব গোপন ও প্রকাশ্য গোনাহ ক্ষমা কর (এবং ক্ষমা কর সেসব গোনাহ) যাতে আমি বাড়াবাড়ি করেছি। আর সেসব গোনাহ যে বিষয়ে তুমি আমার চেয়ে বেশি জান। তুমি প্রথম এবং শেষের মালিক। তুমি ব্যতিত কোনো উপাস্য নেই। "
  }
]
